# Какое слово нужно сложить 5 раз чтобы получить число 5?
# Какое слово нужно умножить на 7 чтобы получить 7?
a=('5'+'5'+'5'+'5'+'5')
a1=1
b='7'
print(a1*b)
print (len(a)) 



a=[x for x in range(1,1000) if x%3==0 or x%5==0]
print(sum(a))

a=333
b=555
c=a
a=b
b=c
print(a,b)


a=[x for x in range(1,1000) if x%3==0 or x%5==0]
print(sum(a))

a=333
b=555
c=a
a=b
b=c
print(a,b)


# Задача 1
# Есть список:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
# Выведите все элементы, которые больше 5.



a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
for i in range(len(a)):
    if a[i]>5:
    print( a[i])
    
    
    #Задача 2
# Есть набор чисел 
# digits = (113,118,-5,1,135,137,0,142,144,17,154,0,155,2,159,172)
# Поделить каждое число из digits на 9 и вывести на экран.


digits = (113,118,-5,1,135,137,0,142,144,17,154,0,155,2,159,172)
for i in digits:

    print(i/9)
    
    # Задание 3:
# Вам дан список:
# numbers = [2,4,7,1,8.4,-3.3,7.1,-2,4,-1,7,-43,8,-3,6,9]
# Определите количество четных и не четных.


numbers = [2,4,7,1,8.4,-3.3,7.1,-2,4,-1,7,-43,8,-3,6,9]

for i in numbers:
    if i%2==0:

        print('четное',i)
    else:
        print('нечетное',i)

    
    
    
